<template>
  <div class="about">
    <h1>Кратное описание</h1>
    <div class="about__content">
      <h2>
        Использовал библиотеку "uuid" для добавления id-шников новым юзерам
      </h2>
      <hr />
      <h2>Для Валидации использовался "Vuelidate"</h2>
      <hr />
      <h2>
        Для сохранения юзеров, без повторного обращения к API, при
        загрузке\перезагрузке приложения использовал LocalStorage
      </h2>
      <hr />
      <h2>
        Переиспользуемые компоненты: Button, Input. Так же в Input добавил
        именованный slot исключительно для каких-то оповещений\алертов, но в
        данном тестовом задании он используется для вывода ошибок валидации.
      </h2>
      <hr />
      <h2>
        <sup style="font-size: 34px; color: chocolate">*</sup>Не судите строго
        по TS :) Я с ним пока еще не работал и решил вот попробовать
        использовать в данном тестовом задании, так как этот момент в принципе
        указан в описании ТЗ...
      </h2>
      <hr />
    </div>
  </div>
</template>
